In [1]:
import pandas as pd
import xlrd

In [2]:
df = pd.read_excel("Canada.xlsx")
df.columns.values

array(['Type', 'Coverage', 'OdName', 'AREA', 'AreaName', 'REG', 'RegName',
       'DEV', 'DevName', 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013], dtype=object)

In [3]:
df_new = df[['OdName','AreaName',1980]].head()

In [4]:
df_new

           OdName AreaName  1980
0     Afghanistan     Asia    16
1         Albania   Europe     1
2         Algeria   Africa    80
3  American Samoa  Oceania     0
4         Andorra   Europe     0

In [5]:
import os

In [6]:
os.getcwd()

'H:\\Pandas'


# Dump Single DataFrame into a single Sheet of Excel

In [10]:
df_new.to_excel(os.path.join(os.getcwd(), "Sample.xlsx"), index=False)

# Dump Multiple DataFrames into Multiple Sheet of excel

In [12]:
df_1 = df_new.copy()

In [13]:
df_2 = df_new.copy()
df_2["New_Col"] = [1,2,3,4,5]

In [14]:
df_1

           OdName AreaName  1980
0     Afghanistan     Asia    16
1         Albania   Europe     1
2         Algeria   Africa    80
3  American Samoa  Oceania     0
4         Andorra   Europe     0

In [15]:
df_2

           OdName AreaName  1980  New_Col
0     Afghanistan     Asia    16        1
1         Albania   Europe     1        2
2         Algeria   Africa    80        3
3  American Samoa  Oceania     0        4
4         Andorra   Europe     0        5

In [22]:
import xlsxwriter   #This Package need to be imported

In [23]:
writer = pd.ExcelWriter(os.path.join(os.getcwd(), "Sample_1.xlsx"), engine="xlsxwriter")

In [24]:
df_1.to_excel(writer, sheet_name = "Sheet1", index=False)

In [25]:
df_2.to_excel(writer, sheet_name = "Sheet2", index=False)

In [26]:
writer.save()

In [27]:
writer.close()